"""
    Найдите боковое ребро правильной четырехугольной призмы, если сторона ее
    основания равна a, а площадь поверхности равна s.
"""


def main():
    a = float(input("Введите сторону основания a "))
    s = float(input("Введите площадь поверхности s "))
    h = lambda a, s: (s - 2*a*a)/(4*a)
    print(h(a, s))


main()